ГТС/УТГТС/Documents/ОперацииОтделаСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацииОтделаСервиса</Name>
			<BasedOn>
				<xr:Item>Catalog.СделкиСКлиентами</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатраченноеВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаДорогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеГарантии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановойГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяОтправкиЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаданияСервису</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийСервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияСервисом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланируемойГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяГотовности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПолучено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийОтложено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийВыполнено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладГотовности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонтаОбслуживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРемонтаИОбслуживания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НужнаАрендаТехники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыполненияРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нормативноевремянаработу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РемонтируемаяНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Техника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Мастера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мастер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/Documents/ОперацииОтделаСервиса/Ext/ManagerModule.bsl
Функция СформироватьПечатнуюФормуНакладной(МассивОбъектов, ОбъектыПечати)
	
	Документ = МассивОбъектов[0];
	
	Макет = ПолучитьМакет("НакладнаяСервиса");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЗапросШапки = Новый Запрос;
	ЗапросШапки.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросШапки.Текст = "ВЫБРАТЬ
	                    |	ОперацииОтделаСервиса.Номер КАК НомерДокумента,
	                    |	ОперацииОтделаСервиса.Контрагент.НаименованиеПолное Как Контрагент,
	                    |	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК Контакты,
	                    |	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	                    |	ОперацииОтделаСервиса.Менеджер КАК МенеджерСервис,
	                    |	ОперацииОтделаСервиса.ПричинаОбращения КАК ПричинаОбращения
	                    |ИЗ
	                    |	Документ.ОперацииОтделаСервиса КАК ОперацииОтделаСервиса
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	                    |		ПО ОперацииОтделаСервиса.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	                    |ГДЕ
	                    |	ОперацииОтделаСервиса.Ссылка = &Ссылка";
				   
	ВыборкаШапки = ЗапросШапки.Выполнить().Выбрать();
	ВыборкаШапки.Следующий();
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.Заполнить(ВыборкаШапки);
	ОбластьШапки.Параметры.Гарантия=?(Документ.НаличиеГарантии=Истина,"!ГАРАНТИЯ!","");
	
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросТоваров.Текст = "ВЫБРАТЬ
	                      |	ОперацииОтделаСервисаРемонтируемаяНоменклатура.Номенклатура,
	                      |	ОперацииОтделаСервисаРемонтируемаяНоменклатура.Количество
	                      |ИЗ
	                      |	Документ.ОперацииОтделаСервиса.РемонтируемаяНоменклатура КАК ОперацииОтделаСервисаРемонтируемаяНоменклатура
	                      |ГДЕ
	                      |	ОперацииОтделаСервисаРемонтируемаяНоменклатура.Ссылка = &Ссылка";
						  
	ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать();
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Пока ВыборкаТоваров.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ВыборкаШапки);
	ОбластьПодвал.Параметры.Дата = Формат(Документ.Дата, "ДЛФ=Д");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ОбластьУсловия = Макет.ПолучитьОбласть("УсловияПриемаХранения");
	ОбластьУсловия.Параметры.Заполнить(ВыборкаШапки);
	ТабличныйДокумент.Вывести(ОбластьУсловия);

	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФорму()

Функция СформироватьПечатнуюФормуАкта(МассивОбъектов, ОбъектыПечати)
	
	Документ = МассивОбъектов[0];
	Макет = ПолучитьМакет("АктГарантия");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЗапросШапки = Новый Запрос;
	ЗапросШапки.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросШапки.Текст = "ВЫБРАТЬ
	                    |	ОперацииОтделаСервиса.Номер,
	                    |	ОперацииОтделаСервиса.Контрагент.НаименованиеПолное Как Контрагент
	                    |ИЗ
	                    |	Документ.ОперацииОтделаСервиса КАК ОперацииОтделаСервиса
	                    |ГДЕ
	                    |	ОперацииОтделаСервиса.Ссылка = &Ссылка";
						
	ВыборкаШапки = ЗапросШапки.Выполнить().Выбрать();
	ВыборкаШапки.Следующий();
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.Заполнить(ВыборкаШапки);
	ОбластьШапки.Параметры.Дата = Формат(Документ.Дата, "ДЛФ=Д");
	
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	ЗапросНоменклатуры = Новый Запрос;
	ЗапросНоменклатуры.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросНоменклатуры.Текст = "ВЫБРАТЬ
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.НомерСтроки,
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Номенклатура,
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Количество
	                           |ИЗ
	                           |	Документ.ОперацииОтделаСервиса.ВыполненныеРаботы КАК ОперацииОтделаСервисаВыполненныеРаботы
	                           |ГДЕ
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Ссылка = &Ссылка";
							   
	ВыборкаНоменклатуры = ЗапросНоменклатуры.Выполнить().Выбрать();
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаНоменклатуры);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;	

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	         

Функция СформироватьПечатнуюФормуАктаПередачиТоваров(МассивОбъектов, ОбъектыПечати)
	
	Документ = МассивОбъектов[0];
	Макет = ПолучитьМакет("АктПередачиТоваров");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЗапросШапки = Новый Запрос;
	ЗапросШапки.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросШапки.Текст = "ВЫБРАТЬ
	                    |	ОперацииОтделаСервиса.Номер,
	                    |	ОперацииОтделаСервиса.Контрагент.НаименованиеПолное как Контрагент
	                    |ИЗ
	                    |	Документ.ОперацииОтделаСервиса КАК ОперацииОтделаСервиса
	                    |ГДЕ
	                    |	ОперацииОтделаСервиса.Ссылка = &Ссылка";
						
	ВыборкаШапки = ЗапросШапки.Выполнить().Выбрать();
	ВыборкаШапки.Следующий();
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.Заполнить(ВыборкаШапки);
	ОбластьШапки.Параметры.Дата = Формат(Документ.Дата, "ДЛФ=Д");
	
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	ЗапросНоменклатуры = Новый Запрос;
	ЗапросНоменклатуры.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросНоменклатуры.Текст = "ВЫБРАТЬ
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.НомерСтроки КАК НомерСтроки,
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Номенклатура КАК Номенклатура,
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Количество КАК Количество,
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Номенклатура.Артикул КАК Артикул
	                           |ИЗ
	                           |	Документ.ОперацииОтделаСервиса.ВыполненныеРаботы КАК ОперацииОтделаСервисаВыполненныеРаботы
	                           |ГДЕ
	                           |	ОперацииОтделаСервисаВыполненныеРаботы.Ссылка = &Ссылка";
							   
	ВыборкаНоменклатуры = ЗапросНоменклатуры.Выполнить().Выбрать();
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаНоменклатуры); 
		ОбластьСтрока.Параметры.Номенклатура= "" + ВыборкаНоменклатуры.Номенклатура + ","+ВыборкаНоменклатуры.Артикул;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;	

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	


Функция СформироватьПечатнуюФормуПодготовкаТехники(МассивОбъектов, ОбъектыПечати)
	
	Документ = МассивОбъектов[0];
	
	Макет = ПолучитьМакет("ПодготовкаТехники");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЗапросШапки = Новый Запрос;
	ЗапросШапки.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросШапки.Текст = "ВЫБРАТЬ
	                    |	ОперацииОтделаСервиса.Номер КАК НомерДокумента,
	                    |	ОперацииОтделаСервиса.ДокументОснование.Ссылка КАК ЗаказКлиента,
	                    |	ОперацииОтделаСервиса.ДокументОснование.Партнер КАК Партнер,
	                    |	ОперацииОтделаСервиса.ДокументОснование.Менеджер КАК Менеджер,
	                    |	ОперацииОтделаСервиса.Склад КАК Склад,
	                    |	ОперацииОтделаСервиса.КомментарийМенеджера КАК КомментарийМенеджера,
	                    |	ОперацииОтделаСервиса.Контрагент.НаименованиеПолное КАК Контрагент
	                    |ИЗ
	                    |	Документ.ОперацииОтделаСервиса КАК ОперацииОтделаСервиса
	                    |ГДЕ
	                    |	ОперацииОтделаСервиса.Ссылка = &Ссылка";
				   
	ВыборкаШапки = ЗапросШапки.Выполнить().Выбрать();
	ВыборкаШапки.Следующий();
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапки.Параметры.Заполнить(ВыборкаШапки);
	
	ТабличныйДокумент.Вывести(ОбластьШапки);
	
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.УстановитьПараметр("Ссылка", Документ);
	
	ЗапросТоваров.Текст = "ВЫБРАТЬ
	                      |	ОперацииОтделаСервисаТехника.Номенклатура КАК Номенклатура,
	                      |	ОперацииОтделаСервисаТехника.Количество КАК Количество,
	                      |	ОперацииОтделаСервисаТехника.Номенклатура.Артикул КАК Артикул
	                      |ИЗ
	                      |	Документ.ОперацииОтделаСервиса.Техника КАК ОперацииОтделаСервисаТехника
	                      |ГДЕ
	                      |	ОперацииОтделаСервисаТехника.Ссылка = &Ссылка";
						  
	ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать();
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	Пока ВыборкаТоваров.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Дата = Формат(Документ.Дата, "ДЛФ=Д");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 


// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати,
				 КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
		 Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "НакладнаяСервиса") Тогда
					 
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"НакладнаяСервиса",
			"Накладная сервиса",
			СформироватьПечатнуюФормуНакладной(МассивОбъектов, ОбъектыПечати)
			);
					 
		КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктГарантия") Тогда
					 
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АктГарантия",
			"Акт гарантия",
			СформироватьПечатнуюФормуАкта(МассивОбъектов, ОбъектыПечати)
			);
					 
		КонецЕсли;    
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПередачиТоваров") Тогда
					 
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АктПередачиТоваров",
			"Акт передачи товаров",
			СформироватьПечатнуюФормуАктаПередачиТоваров(МассивОбъектов, ОбъектыПечати)
			);
					 
		КонецЕсли;


		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПодготовкаТехники") Тогда
					 
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПодготовкаТехники",
			"Подготовка техники",
			СформироватьПечатнуюФормуПодготовкаТехники(МассивОбъектов, ОбъектыПечати)
			);
					 
		КонецЕсли;

	КонецПроцедуры
	
	
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры


Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры
